app/controllers/api/users_controller.rb

SELECT 1 FROM `users` WHERE (`users`.`email` = BINARY 'tzb_test_1@nbd.com.cn') LIMIT 1
SELECT `mn_accounts`.* FROM `mn_accounts` WHERE (`mn_accounts`.user_id = 209394) LIMIT 1
INSERT INTO `users` (`email`, `nickname`, `image_id`, `desc`, `hashed_password`, `salt`, `reg_from`, `user_type`, `auth_token`, `status`, `password_reset_token`, `password_reset_sent_at`, `activate_token`, `activate_sent_at`, `followings_count`, `followers_count`, `stocks_count`, `weibos_count`, `verified`, `delta`, `created_at`, `updated_at`, `access_token`, `token_updated_at`, `credits`, `phone_no`, `real_name`) VALUES ('tzb_test_1@nbd.com.cn', 'tzb_user', NULL, NULL, 'a2abcb65a3fd2940b20d234555af16e6', '796020800.5928719181454126', 0, 1, 'lsjSpyeOLClqD4nfrYq9SskxkPwr-b5y', 0, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 1, '2013-05-02 14:51:49', '2013-05-02 14:51:49', NULL, NULL, 0, NULL, NULL)
INSERT INTO `mn_accounts` (`user_id`, `plan_type`, `phone_no`, `last_active_from`, `last_payment_at`, `service_end_at`, `created_at`, `updated_at`, `last_sended_at`, `last_activated_device`, `access_token`, `access_token_updated_at`, `last_trade_num`, `is_receive_credits`, `gift_details`, `is_receive_sms`) VALUES (209394, -1, NULL, 2, '2013-05-02 14:51:49', '2013-05-09 14:51:49', '2013-05-02 14:51:49', '2013-05-02 14:51:49', NULL, 'apple', NULL, NULL, NULL, 0, '赠送7天', 0)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 209394 LIMIT 1
---
  def create
    @user = User.new(:nickname => params[:nickname], :email => params[:email], :password => params[:password], :password_confirmation => params[:phone_no].blank? ? params[:password_confirmation] : params[:password])
    gift_period = params[:phone_no].blank? ? MnAccount::ONE_WEEK_GIFT_TIME : MnAccount::TWO_WEEK_GIFT_TIME
    is_receive_sms = false
    last_active_from = current_device
    if @user.save
      if @mn_account
        if @mn_account.binded?
          @user.create_mn_account_gift(last_active_from, gift_period, is_receive_sms, params[:phone_no])
        else
          @mn_account = @mn_account.bind_user(@user)
        end
      else
        @user.create_mn_account_gift(last_active_from,gift_period,is_receive_sms,params[:phone_no])
      end
      @user.reload

      update_user_session @user

      return render :json => create_json_result(@user.mn_account)
    else
      error = {}
      @user.errors.each do |k, v|

SELECT `mn_accounts`.* FROM `mn_accounts` WHERE `mn_accounts`.`last_trade_num` = '086qyu' LIMIT 1
SELECT `mn_accounts`.* FROM `mn_accounts` WHERE `mn_accounts`.`access_token` = '3c968bd934a96fac0895e3a6cd481138' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 205253 LIMIT 1
INSERT INTO `mn_accounts` (`user_id`, `plan_type`, `phone_no`, `last_active_from`, `last_payment_at`, `service_end_at`, `created_at`, `updated_at`, `last_sended_at`, `last_activated_device`, `access_token`, `access_token_updated_at`, `last_trade_num`, `is_receive_credits`, `gift_details`, `is_receive_sms`) VALUES (203811, -1, NULL, 2, '2013-05-02 15:33:44', '2013-05-09 15:33:44', '2013-05-02 15:33:44', '2013-05-02 15:33:44', NULL, 'apple', NULL, NULL, NULL, 0, '赠送7天', 0)
---
  def sign_in
    if params[:trade_num]
      @mn_account = MnAccount.where(:last_trade_num => params[:trade_num]).first
      return render :json => {:error => "您的订单号码不正确"}, :status => 401 if @mn_account.nil?
      @mn_account.check_access_token
      @mn_account.check_access_token(@mn_account.access_token)
      update_user_session @mn_account.user if @mn_account.present? && @mn_account.user.present?
      return render :json => create_json_result(@mn_account)
    else
      if user = User.authenticate(params[:nickname], params[:password])
        @user = user
        update_user_session user
        if @mn_account
          @mn_account = @mn_account.bind_user(@user) unless @mn_account.binded?
          @mn_account.check_access_token
        else
          if user.mn_account.nil?
            user.create_mn_account_gift(current_device,MnAccount::ONE_WEEK_GIFT_TIME,false,nil)