app/controllers/premium/mobile_newspaper_accounts_controller.rb

  def activate
    if !@current_user.mn_account.try(:phone_no).blank? and params[:mobile_no] =~ /^\d{11}$/
      @phone_no_error = true
      params[:type] = "1"
      return render :new
    end

    flash[:captcha_error] = nil
    if !simple_captcha_valid?("simple_captcha")
      flash[:captcha_error] = "验证码错误！"
      params[:type] = "1"
      return render :action => "new"
    end

    @service_card = ServiceCard.where(:password => params[:password]).first
---
SELECT `mn_accounts`.* FROM `mn_accounts` WHERE (`mn_accounts`.user_id = 203811) LIMIT 1
SELECT `service_cards`.* FROM `service_cards` WHERE `service_cards`.`password` = 'nbd3690949250959' LIMIT 1