#encoding:utf-8
namespace :ad_positions do
  task :init => :environment do
    init_arr = [
                  ["首页", "a-0", 990,200], 
                  ["首页", "a-1", 700,70], 
                  ["首页", "a-2", 990,90], 
                  ["首页", "a-2-1", 670,90], 
                  ["首页", "a-2-2", 300,90], 
                  ["首页", "a-3", 990,90], 
                  ["首页", "a-3-1", 670,90], 
                  ["首页", "a-3-2", 300,90], 
                  ["首页", "a-4", 990,90], 
                  ["首页", "a-4-1", 670,90], 
                  ["首页", "a-4-2", 300,90], 
                  ["首页", "a-5", 990,90], 
                  ["首页", "a-5-1", 670,90], 
                  ["首页", "a-5-1", 300,90], 
                  ["首页", "a-6", 990,90], 
                  ["文章页", "b-1", 700,70], 
                  ["文章页", "b-2", 300,300], 
                  ["文章页", "b-3", 300,300], 
                  ["文章页", "b-4", 990,90], 
                  ["文章页", "b-5", 300,200], 
                  ["栏目页", "c-1", 700,70], 
                  ["栏目页", "c-2", 300,600], 
                  ["栏目页", "c-3", 300,300], 
                  ["栏目页", "c-4", 990,90], 
                  ["栏目页", "c-5", 670,70] 
                ]
    init_arr.each do |ad_p|
      AdPosition.create(:name => ad_p[1], :desc => ad_p[0], :width => ad_p[2], :height => ad_p[3], :current_ad_id => 0, :price => 0)
    end
  end
end
