app/views/premium/mobile_newspaper_accounts/new.html.erb

    </p>
    <% if !@current_user.mn_account or @current_user.mn_account.phone_no.blank? %>
---
SELECT `mn_accounts`.* FROM `mn_accounts` WHERE (`mn_accounts`.user_id = 203811) LIMIT 1